NextFOAM-2405/tutorials/combustion/fireFoam/LES/simplePMMApanel/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    coupledPatch;
        type    faceSet;
        action  new;
        source  patchToFace;
        patch   coupledPatch;
    }

    {
        name    panel;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        faceSet coupledPatch;
    }
);


// ************************************************************************* //
